export interface Event {
    summary: string
    start: string
    end: string
    day_of_week: string
    description: string
    location: string
    week_parity: string
}

export interface ScheduleData {
    events_by_calname: {
        [key: string]: Event[]
    }
}

export const mockTeacherSchedule: ScheduleData = {
    "events_by_calname": {
        "Волков М. Ю.": [
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Среда",
                "description": "ИКБО-01-22\n",
                "location": "Г-226-1 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Среда",
                "description": "ИКБО-01-22\n",
                "location": "Г-226-1 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Среда",
                "description": "ИКБО-01-22\n",
                "location": "Г-226-1 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Среда",
                "description": "ИКБО-01-22\n",
                "location": "Г-226-1 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Среда",
                "description": "ИКБО-30-22\n",
                "location": "Г-226-1 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Среда",
                "description": "ИКБО-30-22\n",
                "location": "Г-226-1 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "18:00",
                "end": "19:30",
                "day_of_week": "Среда",
                "description": "ИКБО-30-22\n",
                "location": "Г-226-1 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "18:00",
                "end": "19:30",
                "day_of_week": "Среда",
                "description": "ИКБО-30-22\n",
                "location": "Г-226-1 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Архитектура, проектирование и разработка программных средств",
                "start": "19:40",
                "end": "21:10",
                "day_of_week": "Среда",
                "description": "ИКМО-05-24\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Архитектура, проектирование и разработка программных средств",
                "start": "19:40",
                "end": "21:10",
                "day_of_week": "Среда",
                "description": "ИКМО-05-24\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Архитектура, проектирование и разработка программных средств",
                "start": "19:40",
                "end": "21:10",
                "day_of_week": "Четверг",
                "description": "ИКМО-06-24\n",
                "location": "Г-227-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Архитектура, проектирование и разработка программных средств",
                "start": "19:40",
                "end": "21:10",
                "day_of_week": "Четверг",
                "description": "ИКМО-06-24\n",
                "location": "Г-227-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Архитектура клиент-серверных приложений",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Пятница",
                "description": "ИКБО-15-23\n",
                "location": "А-422 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Пятница",
                "description": "ИКБО-16-22\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Пятница",
                "description": "ИКБО-16-22\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Пятница",
                "description": "ИКБО-16-22\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Пятница",
                "description": "ИКБО-16-22\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Пятница",
                "description": "ИКБО-20-22\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Пятница",
                "description": "ИКБО-20-22\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "18:00",
                "end": "19:30",
                "day_of_week": "Пятница",
                "description": "ИКБО-20-22\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "18:00",
                "end": "19:30",
                "day_of_week": "Пятница",
                "description": "ИКБО-20-22\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Архитектура, проектирование и разработка программных средств",
                "start": "19:40",
                "end": "21:10",
                "day_of_week": "Пятница",
                "description": "ИКМО-05-24\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ЛК Бэкенд-разработка",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Суббота",
                "description": "ИКБО-10-23\nИКБО-11-23\nИКБО-12-23\nИКБО-13-23\nИКБО-14-23\nИКБО-15-23\n",
                "location": "А-18 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ЛК Проектирование и разработка серверных частей интернет-ресурсов",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Суббота",
                "description": "ИКБО-20-23\nИКБО-21-23\nИКБО-22-23\n",
                "location": "Б-105 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ЛК Технологии виртуализации клиент-серверных приложений",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Суббота",
                "description": "ИКБО-01-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Архитектура, проектирование и разработка программных средств",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Суббота",
                "description": "ИКМО-06-24\n",
                "location": "А-422 (В-78)",
                "week_parity": "четная"
            }
        ]
    }
}

