export interface Event {
    summary: string
    start: string
    end: string
    day_of_week: string
    description: string
    location: string
    week_parity: string
}

export interface ScheduleData {
    events_by_calname: {
        [key: string]: Event[]
    }
}

export const mockStudentSchedule: ScheduleData = {
    "events_by_calname": {
        "ИКБО-16-22": [
            {
                "summary": "ПР Информационный менеджмент программных продуктов и систем",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Понедельник",
                "description": "Преподаватель: Братусь Надежда Валерьевна\n",
                "location": "И-205-а (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Информационный менеджмент программных продуктов и систем",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Понедельник",
                "description": "Преподаватель: Братусь Надежда Валерьевна\n",
                "location": "И-205-а (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ЛК Управление информационно-технологическими проектами",
                "start": "18:00",
                "end": "19:30",
                "day_of_week": "Понедельник",
                "description": "Преподаватель: Потапова Ксения Александровна\n\nГруппы:\nИКБО-01-22\nИКБО-02-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ЛК Управление информационно-технологическими проектами",
                "start": "18:00",
                "end": "19:30",
                "day_of_week": "Понедельник",
                "description": "Преподаватель: Потапова Ксения Александровна\n\nГруппы:\nИКБО-01-22\nИКБО-02-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Информационный менеджмент программных продуктов и систем",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Вторник",
                "description": "Преподаватель: Братусь Надежда Валерьевна\n",
                "location": "И-205-а (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Информационный менеджмент программных продуктов и систем",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Вторник",
                "description": "Преподаватель: Братусь Надежда Валерьевна\n",
                "location": "И-205-а (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Имитационное моделирование клиент-серверных приложений",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Среда",
                "description": "Преподаватель: Коваленко Михаил Андреевич\n",
                "location": "Г-227-1 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Имитационное моделирование клиент-серверных приложений",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Среда",
                "description": "Преподаватель: Коваленко Михаил Андреевич\n",
                "location": "Г-227-1 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Имитационное моделирование клиент-серверных приложений",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Среда",
                "description": "Преподаватель: Коваленко Михаил Андреевич\n",
                "location": "Г-227-1 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Имитационное моделирование клиент-серверных приложений",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Среда",
                "description": "Преподаватель: Коваленко Михаил Андреевич\n",
                "location": "Г-227-1 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Проектирование клиент-серверных систем",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Мельников Денис Александрович\n",
                "location": "И-203-б (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Проектирование клиент-серверных систем",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Мельников Денис Александрович\n",
                "location": "И-203-б (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Проектирование клиент-серверных систем",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Мельников Денис Александрович\n",
                "location": "И-203-б (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Информационный менеджмент программных продуктов и систем",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Братусь Надежда Валерьевна\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Информационный менеджмент программных продуктов и систем",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Братусь Надежда Валерьевна\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Управление информационно-технологическими проектами",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Габриелян Гайк Ашотович\n",
                "location": "Д-313 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Информационный менеджмент программных продуктов и систем",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Братусь Надежда Валерьевна\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Управление информационно-технологическими проектами",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Габриелян Гайк Ашотович\n",
                "location": "Д-313 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Управление информационно-технологическими проектами",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Габриелян Гайк Ашотович\n",
                "location": "И-202-а (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Управление информационно-технологическими проектами",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Четверг",
                "description": "Преподаватель: Габриелян Гайк Ашотович\n",
                "location": "И-202-а (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Разработка клиент-серверных приложений",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Романченко Алексей Евгеньевич\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Разработка клиент-серверных приложений",
                "start": "09:00",
                "end": "10:30",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Романченко Алексей Евгеньевич\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Разработка клиент-серверных приложений",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Романченко Алексей Евгеньевич\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Разработка клиент-серверных приложений",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Романченко Алексей Евгеньевич\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Волков Михаил Юрьевич\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Волков Михаил Юрьевич\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Волков Михаил Юрьевич\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии виртуализации клиент-серверных приложений",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Волков Михаил Юрьевич\n",
                "location": "Г-226-2 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии и инструментарий анализа больших данных",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Тетерин Николай Николаевич\n",
                "location": "А-421 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии и инструментарий анализа больших данных",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Тетерин Николай Николаевич\n",
                "location": "Г-413 (В-78)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ПР Технологии и инструментарий анализа больших данных",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Тетерин Николай Николаевич\n",
                "location": "А-421 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ПР Технологии и инструментарий анализа больших данных",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Пятница",
                "description": "Преподаватель: Тетерин Николай Николаевич\n",
                "location": "Г-413 (В-78)",
                "week_parity": "четная"
            },
            {
                "summary": "ЛК Разработка клиент-серверных приложений",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Суббота",
                "description": "Преподаватель: Коваленко Михаил Андреевич\n\nГруппы:\nИКБО-01-22\nИКБО-02-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ЛК Технологии и инструментарий анализа больших данных",
                "start": "10:40",
                "end": "12:10",
                "day_of_week": "Суббота",
                "description": "Преподаватель: Юрченков Иван Александрович\n\nГруппы:\nИКБО-01-22\nИКБО-02-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "четная"
            },
            {
                "summary": "ЛК Имитационное моделирование клиент-серверных приложений",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Суббота",
                "description": "Преподаватель: Акопов Андраник Сумбатович\n\nГруппы:\nИКБО-01-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ЛК Проектирование клиент-серверных систем",
                "start": "12:40",
                "end": "14:10",
                "day_of_week": "Суббота",
                "description": "Преподаватель: Лобанов Александр Анатольевич\n\nГруппы:\nИКБО-01-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "четная"
            },
            {
                "summary": "ЛК Информационный менеджмент программных продуктов и систем",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Суббота",
                "description": "Преподаватель: Лобанов Александр Анатольевич\n\nГруппы:\nИКБО-01-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "нечетная"
            },
            {
                "summary": "ЛК Информационный менеджмент программных продуктов и систем",
                "start": "14:20",
                "end": "15:50",
                "day_of_week": "Суббота",
                "description": "Преподаватель: Лобанов Александр Анатольевич\n\nГруппы:\nИКБО-01-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "четная"
            },
            {
                "summary": "ЛК Технологии виртуализации клиент-серверных приложений",
                "start": "16:20",
                "end": "17:50",
                "day_of_week": "Суббота",
                "description": "Преподаватель: Волков Михаил Юрьевич\n\nГруппы:\nИКБО-01-22\nИКБО-16-22\nИКБО-20-22\nИКБО-30-22\nИКБО-36-22\n",
                "location": "Дистанционно (СДО)",
                "week_parity": "нечетная"
            }
        ]
    }
}

